function [X, k, err] = m_ns_kurch(F, Divdif, X, e, mki, X1)
% Знаходження розв'язку нелiнiйної системи рiвнянь F(X) = 0
% iтерацiйним м.Курчатова
%  F(2*X(k)-X(k-1);X(k-1))*(X(k+1) - X(k)) = -F(X(k)), k=0,1,...,mki,
%   де X(-1),X(0) - вiдомі (параметри X1, X),
%   а  F(U;V) - узагальнені поділені різниці(I) першого порядку.
% Умова закiнчення iтерацiй : norm(X(k+1)-X(k))<e.
% вхiднi данi :
%   F      - функцiя, яка при fun=0 обчислює F(X);
%   Divdif - функцiя, яка обчислює F(U;V);
%   X      - ( 0)-наближення до розв'язку;
%   X1    - (-1)-наближення до розв'язку;
%   e      - точнiсть (0<e<1);
%   mki    - максимальна кiлькiсть крокiв iтерацiй.
% вихiднi данi:
%   X      - фiнiшне наближення до розв'язку;
%   k      - кiлькiсть виконаних iтерацiй;
%   err    - 0=знайдено розв'язок, 1= k>mki.
global fun
fun = 0;
if e < 0 | e > 1
    e = 1e-6;
end
Fkm = F(X1); Fk = F(X);
for k = 1 : mki
   O = 2.*X-X1; R = Divdif(O,X1); O = -R\Fk;
   X1 = X; X = X + O;
   if norm(O) < e
       err = 0; return
   end
   Fkm = Fk; Fk = F(X);
end
err = 1;
return