function [X, k, err] = m_ns_njut(f_J, X, e, mki)
% «находженн€ розв'€зку нелiнiйноњ системи рiвн€нь F(X) = 0
% iтерацiйним м.Ќьютона
%          J(X(k))*(X(k+1)-X(k)) = -F(X(k)), k=0,1,...,mki,
% де X(0)- вiдоме, а J(X) - матриц€ якобi
%          (dFi(X)/dXj), i,j=1,...,n.
% ”мова закiнченн€ iтерацiй : norm(X(k+1)-X(k))<e.
% вхiднi данi :
%   f_J    - функцi€, €ка обчислюЇ пару {F(X),J(X)} при fun=1;
%   X      - початкове наближенн€ до розв'€зку;
%   e      - точнiсть (0<e<1);
%   mki    - максимальна кiлькiсть крокiв iтерацiй.
% вихiднi данi:
%   X      - фiнiшне наближенн€ до розв'€зку;
%   k      - кiлькiсть виконаних iтерацiй;
%   err    - 0=знайдено розв'€зок, 1= k>mki.
global fun
fun = 1;
if e < 0 | e > 1
    e = 1e-6;
end
for k = 1 : mki
   [O, J] = f_J(X); O = -J\O; X = X + O;
   if norm(O) < e
       err = 0; return
   end
end
err = 1;
return