function  s = i_cheb(a, b, f, n)
% Знаходження значення визначеного iнтеграла
%                        b
%                  s = S f(x) dx
%                        a
% з допомогою КФ Чебишева.
% Вхiднi данi :
%    a - нижня границя iнтеграла;
%    b - верхня границя iнтеграла;
%    f - функцiя з описом f(x);
%    n - кiлькiсть вузлів n є [1,7] або n=9.
% Вихiднi данi:
%    s - значення iнтегралу.
%
s = 0;
if a > b
  error('I_CHEB:error a>b.','a>b.  See I_CHEB.')
end
if n < 1 | n == 8 | n > 10 
  error('I_CHEB:error n<1 or n=8 or n>10.',' not (n є [1,7] or n=9).  See I_CHEB.')
end

% в залежності від n визначаємо вузли і вагові коефіцієнти :
X = zeros(1, n); C = 2./n;
switch n
   case 1

   case 2
       X(2) = 0.5773502691; X(1) = - X(2);
   case 3
       X(3) = 0.7071067812; X(1) = - X(3);
   case 4
       X(4) = 0.7946544723; X(1) = - X(4);
       X(3) = 0.1875924741; X(2) = - X(3);
   case 5
       X(5) = 0.8324974870; X(1) = - X(5);
       X(4) = 0.3745414096; X(2) = - X(4);
   case 6
       X(6) = 0.8662468181; X(1) = - X(6);
       X(5) = 0.4225186538; X(2) = - X(5);
       X(4) = 0.2666354015; X(3) = - X(4);
   case 7
       X(7) = 0.8838617008; X(1) = - X(7);
       X(6) = 0.5296567753; X(2) = - X(6);
       X(5) = 0.3239118105; X(3) = - X(5);
   case 9
       X(9) = 0.9115893007; X(1) = - X(9);
       X(8) = 0.6010186554; X(2) = - X(8);
       X(7) = 0.5287617831; X(3) = - X(7);
       X(6) = 0.1679061842; X(4) = - X(6);
end

% якщо [a,b]<>[-1,1], то виконуємо лінійне перетворення :
if a ~= -1 | b ~= 1
  ab = 0.5 .* (a + b); ba = 0.5 .* (b - a);
  X = ab + ba .* X;  C = ba .* C;
end

% наближене значення інтеграла : 
for i = 1:n
   s = s + f(X(i));
end
s = C.*s;
return