function s = i_crectn(a, b, f, n)
% «находженн€ значенн€ визначеного iнтеграла
%                      b
%                  s = S f(x) dx
%                      a
% з допомогою  ‘ м.центр.пр€мокутник≥в на р≥вном≥рн≥й
%   ф≥ксован≥й с≥тц≥.
% ¬хiднi данi :
%    a - нижн€ границ€ iнтеграла;
%    b - верхн€ границ€ iнтеграла;
%    f - функцi€ з описом f(x);
%    n - кiлькiсть точок сiтки.
% ¬ихiднi данi :
%     s Ц значенн€ iнтегралу.
A = a; B = b; z = 1;
if a > b
   A = b; B = a; z = -1;
end
if n < 0
    n = -n;
elseif n == 0
    n = 21;
end
x = linspace(A, B, n);
s = 0; xr = x(1);
for k = 1 : n-1
    xl = xr; xr = x(k+1); s = s + f(0.5.*(xl+xr));
end
s = z.*(x(2)-x(1)).*s;
return