function  s = i_ermit(a, b, f, n)
% «находженн€ значенн€ визначеного iнтеграла
%                        b
%                  s = S 1/sqrt(1-x^2) * f(x) dx
%                        a
% з допомогою  ‘ ≈рм≥та.
% ¬хiднi данi :
%    a - нижн€ границ€ iнтеграла;
%    b - верхн€ границ€ iнтеграла;
%    f - функцi€ з описом f(x);
%    n - кiлькiсть вузл≥в.
% ¬ихiднi данi :
%    s - значенн€ iнтегралу.
%
s = 0;
if a > b
  error('I_ERMIT:error a>b.','a>b.  See I_ERMIT.')
end

% в залежност≥ в≥д n визначаЇмо вузли ≥ вагов≥ коеф≥ц≥Їнти :
C = pi./n; X = linspace(1,n,n); X = cos((X - 0.5).*C);

% €кщо [a,b]<>[-1,1], то виконуЇмо л≥н≥йне перетворенн€ :
if a ~= -1 | b ~= 1
  ab = 0.5 .* (a + b); ba = 0.5 .* (b - a);
  X = ab + ba .* X;  C = ba .* C;
end

% наближене значенн€ ≥нтеграла : 
for i =1:n
   s = s + f(X(i));
end
s = C.*s;
return