function  s = i_gauss(a, b, f, n)
% «находженн€ значенн€ визначеного iнтеграла
%                        b
%                  s = S f(x) dx
%                        a
% з допомогою  ‘ √аусса.
% ¬хiднi данi :
%    a - нижн€ границ€ iнтеграла;
%    b - верхн€ границ€ iнтеграла;
%    f - функцi€ з описом f(x);
%    n - кiлькiсть вузл≥в (0<n<8).
% ¬ихiднi данi :
%    s - значенн€ iнтегралу.
%
s = 0;
if a > b
  error('I_GAUSS:error a>b.','a>b.  See I_GAUSS.')
end
if n < 1 | n > 7
  error('I_GAUSS:error n<1 or n>7.',' not (n ™ [1,7]).  See I_GAUSS.')
end

% в залежност≥ в≥д n визначаЇмо вузли ≥ вагов≥ коеф≥ц≥Їнти :
X = zeros(1,n); C = ones(1,n);
switch n
   case 1

   case 2
       X(2) = 0.5773502691896258; X(1) = - X(2); C = [0.5, 0.5];       
   case 3
       X(3) = 0.7745966692414834; X(1) = - X(3); C = [5, 8, 5]./18;
   case 4
       X(4) = 0.8611363115940492; X(1) = - X(4);
       X(3) = 0.3399810435848646; X(2) = - X(3);
       C(4) = 0.1739274225687284; C(1) = C(4);
       C(3) = 0.3260725774312716; C(2) = C(3);
   case 5
       X(5) = 0.9061798459386640; X(1) = -X(5);
       X(4) = 0.5384693101056830; X(2) = - X(4);
       C(5) = 0.1184634425280945; C(1) = C(5);
       C(4) = 0.2393143352496832; C(2) = C(4); C(3) = 64./225;
   case 6
       X(6) = 0.9324695142031520; X(1) = - X(6);
       X(5) = 0.6612093864662644; X(2) = - X(5);
       X(4) = 0.2386191860831970; X(3) = - X(4);
       C(6) = 0.0856622461895852; C(1) = C(6);
       C(5) = 0.1803807865240693; C(2) = C(5);
       C(4) = 0.2339569672863455; C(3) = C(4);
   case 7
       X(7) = 0.9491079123427596; X(1) = - X(7);
       X(6) = 0.7415311855993944; X(2) = - X(6);
       X(5) = 0.4058451513773970; X(3) = - X(5);
       C(7) = 0.0647424830844348; C(1) = C(7);
       C(6) = 0.1398526957446384; C(2) = C(6);
       C(5) = 0.1909150252525595; C(3) = C(5); C(4) = 256./1225;
end
C = 2.*C;

% €кщо [a,b]<>[-1,1], то виконуЇмо л≥н≥йне перетворенн€ :
if a ~= -1 | b ~= 1
  ab = 0.5 .* (a + b); ba = 0.5 .* (b - a);
  for i = 1:n
    X(i) = ab + ba .* X(i); C(i) = ba .* C(i);
  end
end

% наближене значенн€ ≥нтеграла : 
for i = 1:n
   s = s + C(i).*f(X(i));
end
return