function  S = i_lager(f, n)
% Знаходження значення невласного iнтеграла
%                     inf
%                  S = S exp(-x)*f(x) dx
%                      0
% з допомогою КФ Лагерра.
% Вхiднi данi :
%    f - функцiя з описом f(x);
%    n - кiлькiсть вузлів (0<n<6).
% Вихiднi данi :
%    S - значення iнтегралу.
%
S = 0;
if n < 1 | n > 5
  error('I_LAGER:error n<1 or n>5.',' See I_LAGER.')
end

% в залежності від n визначаємо вузли і вагові коефіцієнти :
switch n
   case 1
       X = [1]; C = [1];
   case 2
       X = [0.585786, 3.414214]; C = [0.853553, 0.146447];       
   case 3
       X = [0.415775, 2.29428, 6.289945];
       C = [0.711093, 0.278518, 0.0103893];
   case 4
       X = [0.322548, 1.745761, 4.53662, 9.395071];
       C = [0.603154, 0.357419, 0.0388879, 0.000539295];
   case 5
       X = [0.26356, 1.413403, 3.596426, 7.08581, 12.640801];
       C = [0.521756, 0.398667, 0.0759424, 0.00361176 ,0.00002337];
end
S = dot(C, f(X));  % наближене значення інтеграла
return