function  s = i_markov(a, b, f, n)
% Знаходження значення визначеного iнтеграла
%                        b
%                  s = S f(x) dx
%                        a
% з допомогою КФ Маркова.
% Вхiднi данi :
%    a - нижня границя iнтеграла;
%    b - верхня границя iнтеграла;
%    f - функцiя з описом f(x);
%    n - кiлькiсть вузлів (n є [2,10]).
% Вихiднi данi:
%    s - значення iнтегралу.
%
s = 0;
if a > b
  error('I_MARKOV:error a>b.','See I_MARKOV.')
end
if n < 2 | n > 10
  error('I_MARKOV:error n<2 or n>10.','See I_MARKOV.')
end

% в залежності від n визначаємо вузли і вагові коефіцієнти :
X = linspace(-1, 1, n); C = ones(1, n);
switch n
   case 2

   case 3
       C = [1, 4, 1]./3;
   case 4
       X(3) = 1./5; X(2) = - X(3); C = [1, 5, 5, 1]./6;
   case 5
       X(4) = 3./7; X(2) = - X(4); C = [9, 49, 64, 49, 9]./90;
   case 6
       X(5) = 0.76505532; X(2) = - X(5);
       X(4) = 0.28523152; X(3) = - X(4);
       C(6) = 0.06666667; C(1) = C(6);
       C(5) = 0.37847496; C(2) = C(5);
       C(4) = 0.55485837; C(3) = C(4);
   case 7
       X(6) = 0.83022390; X(2) = - X(6);
       X(5) = 0.46884879; X(3) = - X(5);
       C(7) = 0.04761905; C(1) = C(7);
       C(6) = 0.27682605; C(2) = C(6);
       C(5) = 0.43174538; C(3) = C(5); C(4)=0.48761905;
   case 8
       X(7) = 0.87174015; X(2) = - X(7);
       X(6) = 0.59170018; X(3) = - X(6);
       X(5) = 0.20929922; X(2) = - X(5);
       C(8) = 0.03571429; C(1) = C(8);
       C(7) = 0.21070423; C(2) = C(7);
       C(6) = 0.34112268; C(3) = C(6);
       C(5) = 0.41245881; C(4) = C(5);
   case 9
       X(8) = 0.83022390; X(2) = - X(8);
       X(7) = 0.83022390; X(3) = - X(7);
       X(6) = 0.83022390; X(4) = - X(6);
       C(9) = 0.02777778; C(1) = C(9);
       C(8) = 0.16549536; C(2) = C(8);
       C(7) = 0.27453872; C(3) = C(7);
       C(6) = 0.34642851; C(4) = C(6); C(5) = 0.37151927;
   case 10
       X(9) = 0.91953391; X(2) = - X(9);
       X(8) = 0.73877386; X(3) = - X(8);
       X(7) = 0.47792495; X(4) = - X(7);
       X(6) = 0.16527896; X(5) = - X(6);
       C(10) = 0.02222222; C(1) = C(10);
       C(9) = 0.13330599; C(2) = C(9);
       C(8) = 0.22488934; C(3) = C(8);
       C(7) = 0.29204268; C(4) = C(7);
       C(6) = 0.32753976; C(5) = C(6);
end

% якщо [a,b]<>[-1,1], то виконуємо лінійне перетворення :
if a ~= -1 | b ~= 1
  ab = 0.5 .* (a + b); ba = 0.5 .* (b - a);
  for i = 1:n
    X(i) = ab + ba .* X(i); C(i) = ba .* C(i);
  end
end

% наближене значення інтеграла : 
for i = 1:n
   s = s + C(i).*f(X(i));
end
return