function s = i_simpn(a, b, f, n)
% Знаходження значення визначеного iнтеграла
%                      b
%                  s = S f(x) dx
%                      a
% з допомогою КФ м.Сiмпсона на рівномірній
%   фіксованій сітці.
% Вхiднi данi :
%    a - нижня границя iнтеграла;
%    b - верхня границя iнтеграла;
%    f - функцiя з описом f(x);
%    n - кiлькiсть точок сiтки.
% Вихiднi данi :
%    s - значення iнтегралу.
A = a; B = b; z = 1;
if a > b
   A = b; B = a; z = -1;
end
if n < 0
    n = -n;
elseif n == 0
    n = 21;
end
if n < 3
    n = 21;
end
x = linspace(A, B, n);
s = f(A)+f(B)+4.*sum(f(x(2:2:n-1)))+2.*sum(f(x(3:2:n-2)));
s = z.*(x(2)-x(1))./3.*s;
return