function [x, k, err] = m_1estef(ffun, x, e, mki)
% Знаходження кореня нелiнiйного рiвняння   x = f(x)
% нестацiонарним ІМ Ейткена-Стеффенсена
%    x1 = f(x(n)),
%    x2 = f(x1),
%    x(n+1) = x(n)-(x(n)-x1)^2/(x(n)-2*x1-x2)
% де значення x(0) вiдоме.
% Умова закiнчення iтерацiй : abs(x(n+1)-x(n))<e.
% вхiднi данi :
%   x      - початкове наближення до кореня;
%   e      - точнiсть (0<e<1);
%   mki    - максимальна кiлькiсть крокiв iтерацiй;
%   ffun   - функцiя f(x).
% вихiднi данi:
%   x      - фiнiшне наближення до кореня;
%   k      - кiлькiсть виконаних iтерацiй;
%   err    - 0=знайдено, 1= k>mki.

if e < 0 | e > 1
    e = 1e-6;
end
for k = 1 : mki
    x1 = ffun(x); x2 = ffun(x1);
    o = x-x1; o = o.*o./(x-2.0.*x1+x2);
    x = x-o;
    if abs(o) < e
        err = 0; return
    end
end
err = 1;
return