function [X, k, err] = m_ns_grad(f_J, X, e, mki)
% Знаходження розв'язку нелiнiйної системи рiвнянь F(X) = 0
%  ітерацiйним градiєнтним методом, де X(0)- вiдоме.
%  Розр.формули: Б.П.Демидович, И.А.Марон "Основы вычис-
%    лительной математики", Наука,М.,1966.-664с. (стр.485-490).
% Умова закiнчення iтерацiй : norm(X(k+1)-X(k))<e.
% вхiднi данi :
%   f_J    - функцiя, яка обчислює пару {F(X),J(X)} при fun=1;
%   X      - початкове наближення до розв'язку;
%   e      - точнiсть (0<e<1);
%   mki    - максимальна кiлькiсть крокiв iтерацiй.
% вихiднi данi:
%   X      - фiнiшне наближення до розв'язку;
%   k      - кiлькiсть виконаних iтерацiй;
%   err    - 0=знайдено розв'язок, 1= k>mki.
global fun
fun = 1;
if e < 0 | e > 1
    e = 1e-6;
end
for k = 1 : mki
   [z, J] = f_J(X); d = J' * z; v = J * d;
   m = dot(z,v)./dot(v,v); d = m.*d;
   X = X - d;
   if norm(d) < e
       err = 0; return
   end
end
err = 1;
return